# SQL Practice
In my data science program, we had some exposure to SQL. To get some more practice in, I've connected to the Northwind sample database to run some intermediate level queries. Some of the queries were given to me by my instructor and a few of them I've added myself. 

This implementation of the Northwind database is PostgreSQL. PostgreSQL is a great implementation of SQL to learn, because it's very popular, it's free and open-source, and the skills are largely applicable to other implementations. I'm also using the sqlalchemy package in Python to query the database and displaying the data as a Pandas Dataframe. I've obfuscated the connection details in the code below, so unfortunately you will not be able to connect to the database yourself.

I hope you enjoy going through my work and as always, feel free to reach out to me via email (joedorfman@gmail.com).

### First connecting to Northwind database (connection details obfuscated)

git pull test

In [1]:
#import pandas and sqlalchemy
import pandas as pd
from sqlalchemy import create_engine

#create SQL Engine object
engine = create_engine('postgresql://username:password@host/database')

### Exploring the database:

I've copied a description of the Northwind database below. This information can be found [here](https://theaccessbuddy.wordpress.com/2011/07/03/northwind-database-explained/). Overview, this database provide 20 tables to showcase your SQL skills.

> 'Northwind Database is a sample database that is shipped along with Microsoft Access application. Basically, the database is about a company named "Northwind Traders". The database captures all the sales transactions that occurs between the company i.e. Northwind traders and its customers as well as the purchase transactions between Northwind and its suppliers.

> It contains the following detailed information :

> 1. Suppliers/Vendors of Northwind – who supply to the company.
2. Customers of Northwind – who buy from Northwind
3. Employee details of Northwind traders – who work for Northwind
4. The product information – the products that Northwind trades in
5. The inventory details – the details of the inventory held by Northwind traders.
6. The shippers – details of the shippers who ship the products from the traders to the end-customers
7. PO transactions i.e Purchase Order transactions – details of the transactions taking place between vendors & the company.
8. Sales Order transaction – details of the transactions taking place between the customers & the company.
9. Inventory transactions – details of the transactions taking place in the inventory
10. Invoices – details of the invoice raised against the order.'

A printout of the schema can be found below:

![schema](schema.png)

I will begin by querying a few of the tables and displaying the first 5 rows with the pandas .head() method. I will then check for any duplicates or null values in the tables through two functions that I wrote.

In [2]:
#check if there are duplicated values in each series and if there are, return a dictionary with series name and number of duplicated values
def return_number_of_duplicates_by_series(data):
    if sum([data[i].duplicated().sum() for i in data.columns]) > 0: #check if there are duplicated values in the table
        print(f'There are {len(data.apply(lambda x: x.duplicated()).any(axis=1))} total rows with at least 1 duplicated values') #print total number of rows with at least 1 duplicate value
        return {i:data[i].duplicated().sum() for i in data.columns if data[i].duplicated().sum() > 0} #return dictionary with series name and number of duplicated values
    else:
        return 'There are no duplicate values in the table' #if no duplicated values, return a statement to that effect

In [3]:
#check if there are null values in the table and if there are, return a dictionary with the number of null values by series
def return_number_of_nulls_by_series(data):
    if data.isnull().sum().sum() > 0: #check if there are null values in the table
        print(f'There are {len(data[data.isnull().any(axis=1)])} total rows with at least 1 null values') #print total number of rows with at least 1 null value
        return {i:data[i].isnull().sum() for i in data.columns if data[i].isnull().sum() > 0} #return dictionary with series name as key and number of null values as corresponding value
    else:
        return 'There are no null values in the table' #if there are no null values, return a statement to that effect

In [4]:
#selecting all columns from Product table
query = """
SELECT * 
FROM Products
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,8,1,10 boxes x 30 bags,18.00,39,0,10,1
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,1
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1

In [5]:
return_number_of_duplicates_by_series(df)

There are 77 total rows with at least 1 duplicated values

{'SupplierID': 48,
 'CategoryID': 69,
 'QuantityPerUnit': 7,
 'UnitPrice': 16,
 'UnitsInStock': 26,
 'UnitsOnOrder': 67,
 'ReorderLevel': 70,
 'Discontinued': 75}

In [6]:
return_number_of_nulls_by_series(df)

'There are no null values in the table'

In [7]:
#selecting all columns from Employees table
query = """
SELECT * 
FROM Employees
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08,1992-05-01,507 - 20th Ave. E.\nApt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,[],Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1952-02-19,1992-08-14,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,[],Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
2,3,Leverling,Janet,Sales Representative,Ms.,1963-08-30,1992-04-01,722 Moss Bay Blvd.,Kirkland,WA,98033,USA,(206) 555-3412,3355,[],Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp
3,4,Peacock,Margaret,Sales Representative,Mrs.,1937-09-19,1993-05-03,4110 Old Redmond Rd.,Redmond,WA,98052,USA,(206) 555-8122,5176,[],Margaret holds a BA in English literature from...,2.0,http://accweb/emmployees/peacock.bmp
4,5,Buchanan,Steven,Sales Manager,Mr.,1955-03-04,1993-10-17,14 Garrett Hill,London,None,SW1 8JR,UK,(71) 555-4848,3453,[],Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp

In [8]:
return_number_of_duplicates_by_series(df)

There are 9 total rows with at least 1 duplicated values

{'Title': 5,
 'TitleOfCourtesy': 5,
 'HireDate': 1,
 'City': 4,
 'Region': 7,
 'Country': 7,
 'Photo': 8,
 'ReportsTo': 6,
 'PhotoPath': 4}

In [9]:
return_number_of_nulls_by_series(df)

There are 5 total rows with at least 1 null values

{'Region': 4, 'ReportsTo': 1}

There are null values in this table, so I am going to return the nulls values using both a SQL query and pandas.

In [10]:
#selecting all columns from Employees table and returning only rows where there are null values
query = """
SELECT * 
FROM Employees
WHERE "Region" IS NULL OR "ReportsTo" IS NULL
"""

#use pandas read_sql_query method to create a dataframe results of each query
df_null = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df_null.head()

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,2,Fuller,Andrew,"Vice President, Sales",Dr.,1952-02-19,1992-08-14,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,[],Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
1,5,Buchanan,Steven,Sales Manager,Mr.,1955-03-04,1993-10-17,14 Garrett Hill,London,None,SW1 8JR,UK,(71) 555-4848,3453,[],Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp
2,6,Suyama,Michael,Sales Representative,Mr.,1963-07-02,1993-10-17,Coventry House\nMiner Rd.,London,None,EC2 7JR,UK,(71) 555-7773,428,[],Michael is a graduate of Sussex University (MA...,5.0,http://accweb/emmployees/davolio.bmp
3,7,King,Robert,Sales Representative,Mr.,1960-05-29,1994-01-02,Edgeham Hollow\nWinchester Way,London,None,RG1 9SP,UK,(71) 555-5598,465,[],Robert King served in the Peace Corps and trav...,5.0,http://accweb/emmployees/davolio.bmp
4,9,Dodsworth,Anne,Sales Representative,Ms.,1966-01-27,1994-11-15,7 Houndstooth Rd.,London,None,WG2 7LT,UK,(71) 555-4444,452,[],Anne has a BA degree in English from St. Lawre...,5.0,http://accweb/emmployees/davolio.bmp

In [11]:
df[df.isnull().any(axis=1)]

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1952-02-19,1992-08-14,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,[],Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
4,5,Buchanan,Steven,Sales Manager,Mr.,1955-03-04,1993-10-17,14 Garrett Hill,London,None,SW1 8JR,UK,(71) 555-4848,3453,[],Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp
5,6,Suyama,Michael,Sales Representative,Mr.,1963-07-02,1993-10-17,Coventry House\nMiner Rd.,London,None,EC2 7JR,UK,(71) 555-7773,428,[],Michael is a graduate of Sussex University (MA...,5.0,http://accweb/emmployees/davolio.bmp
6,7,King,Robert,Sales Representative,Mr.,1960-05-29,1994-01-02,Edgeham Hollow\nWinchester Way,London,None,RG1 9SP,UK,(71) 555-5598,465,[],Robert King served in the Peace Corps and trav...,5.0,http://accweb/emmployees/davolio.bmp
8,9,Dodsworth,Anne,Sales Representative,Ms.,1966-01-27,1994-11-15,7 Houndstooth Rd.,London,None,WG2 7LT,UK,(71) 555-4444,452,[],Anne has a BA degree in English from St. Lawre...,5.0,http://accweb/emmployees/davolio.bmp

Check to see if it returns the same number of rows:

In [12]:
print(df_null.shape[0])
print(len(df[df.isnull().any(axis=1)]))

5
5

In [13]:
print(df.loc[4, 'Region'])
print(type(df.loc[4, 'Region']))

None
<class 'NoneType'>

None and NaN values are counted as nulls.

In [14]:
#selecting all columns from customers table
query = """
SELECT * 
FROM Customers
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,None,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,None,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,None,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [20]:
return_number_of_duplicates_by_series(df)

There are 91 total rows with at least 1 duplicated values

{'ContactTitle': 79,
 'City': 22,
 'Region': 72,
 'PostalCode': 4,
 'Country': 70,
 'Fax': 21}

In [21]:
return_number_of_nulls_by_series(df)

There are 72 total rows with at least 1 null values

{'Region': 60, 'PostalCode': 1, 'Fax': 22}

In [22]:
df[df.isnull().any(axis=1)].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,None,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,None,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,None,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [23]:
#selecting all columns from suppliers table
query = """
SELECT * 
FROM Suppliers
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,None,EC1 4SD,UK,(171) 555-2222,None,None
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,LA,70117,USA,(100) 555-4822,None,#CAJUN.HTM#
2,3,Grandma Kelly's Homestead,Regina Murphy,Sales Representative,707 Oxford Rd.,Ann Arbor,MI,48104,USA,(313) 555-5735,(313) 555-3349,None
3,4,Tokyo Traders,Yoshi Nagase,Marketing Manager,9-8 Sekimai Musashino-shi,Tokyo,None,100,Japan,(03) 3555-5011,None,None
4,5,Cooperativa de Quesos 'Las Cabras',Antonio del Valle Saavedra,Export Administrator,Calle del Rosal 4,Oviedo,Asturias,33007,Spain,(98) 598 76 54,None,None

In [24]:
return_number_of_duplicates_by_series(df)

There are 29 total rows with at least 1 duplicated values

{'ContactTitle': 14, 'Region': 20, 'Country': 13, 'Fax': 15, 'HomePage': 23}

In [25]:
return_number_of_nulls_by_series(df)

There are 28 total rows with at least 1 null values

{'Region': 20, 'Fax': 16, 'HomePage': 24}

In [26]:
df[df.isnull().any(axis=1)].head()

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,None,EC1 4SD,UK,(171) 555-2222,None,None
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,LA,70117,USA,(100) 555-4822,None,#CAJUN.HTM#
2,3,Grandma Kelly's Homestead,Regina Murphy,Sales Representative,707 Oxford Rd.,Ann Arbor,MI,48104,USA,(313) 555-5735,(313) 555-3349,None
3,4,Tokyo Traders,Yoshi Nagase,Marketing Manager,9-8 Sekimai Musashino-shi,Tokyo,None,100,Japan,(03) 3555-5011,None,None
4,5,Cooperativa de Quesos 'Las Cabras',Antonio del Valle Saavedra,Export Administrator,Calle del Rosal 4,Oviedo,Asturias,33007,Spain,(98) 598 76 54,None,None

# Joining Tables

In [27]:
query = """
SELECT e."EmployeeID", "LastName", "FirstName", "Title", "OrderID", "OrderDate"
FROM Employees as e
INNER JOIN Orders as o ON e."EmployeeID" = o."EmployeeID"
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

   EmployeeID   LastName FirstName                 Title  OrderID   OrderDate
0           5   Buchanan    Steven         Sales Manager    10248  1996-07-04
1           6     Suyama   Michael  Sales Representative    10249  1996-07-05
2           4    Peacock  Margaret  Sales Representative    10250  1996-07-08
3           3  Leverling     Janet  Sales Representative    10251  1996-07-08
4           4    Peacock  Margaret  Sales Representative    10252  1996-07-09

In [28]:
df.shape

(830, 6)

In [29]:
return_number_of_duplicates_by_series(df)

There are 830 total rows with at least 1 duplicated values

{'EmployeeID': 821,
 'LastName': 821,
 'FirstName': 821,
 'Title': 826,
 'OrderDate': 350}

In [30]:
return_number_of_nulls_by_series(df)

'There are no null values in the table'

In [31]:
df.head()

   EmployeeID   LastName FirstName                 Title  OrderID   OrderDate
0           5   Buchanan    Steven         Sales Manager    10248  1996-07-04
1           6     Suyama   Michael  Sales Representative    10249  1996-07-05
2           4    Peacock  Margaret  Sales Representative    10250  1996-07-08
3           3  Leverling     Janet  Sales Representative    10251  1996-07-08
4           4    Peacock  Margaret  Sales Representative    10252  1996-07-09

All rows have at least one duplicate value. Returning a table with columns EmployeeID and OrderDate with duplicates dropped using both pandas and SQL:

In [32]:
df2 = df.drop(['LastName', 'FirstName', 'Title', 'OrderID'], axis=1)
df2.drop_duplicates(inplace=True)

In [33]:
df2.shape

(768, 2)

In [34]:
query = """
SELECT DISTINCT e."EmployeeID","OrderDate"
FROM Employees as e
INNER JOIN Orders as o ON e."EmployeeID" = o."EmployeeID"
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

   EmployeeID   OrderDate
0           6  1998-03-12
1           2  1997-09-15
2           1  1997-12-11
3           8  1998-02-12
4           3  1997-09-26

In [35]:
df.shape

(768, 2)

### Multiple joins

Check out which employees use which shipping companies

In [36]:
query = """
SELECT e."FirstName", e."LastName", s."CompanyName"
FROM Employees as e
JOIN Orders AS o ON e."EmployeeID" = o."EmployeeID"
JOIN Shippers AS s ON o."ShipVia" = s."ShipperID" 
"""

#use pandas read_sql_query method to create a dataframe results of each query
df = pd.read_sql_query(query, engine)

#.head() defaults to displaying first 5 rows
df.head()

  FirstName   LastName       CompanyName
0    Steven   Buchanan  Federal Shipping
1   Michael     Suyama    Speedy Express
2  Margaret    Peacock    United Package
3     Janet  Leverling    Speedy Express
4  Margaret    Peacock    United Package